---
layout: post
title: "ë„¤íŠ¸ì›Œí‚¹ ì™„ì „ ê°€ì´ë“œ 3í¸ - ë¼ìš°íŒ…ê³¼ ìŠ¤ìœ„ì¹­ ì‹¬í™” | Complete Network Guide Part 3 - Advanced Routing & Switching"
date: 2024-11-03 11:00:00 +0900
categories: [Networking, Routing-Switching]
tags: [routing, switching, vlan, stp, ospf, bgp, vxlan, network-protocols]
---

ë„¤íŠ¸ì›Œí¬ì˜ í•µì‹¬ì¸ ë¼ìš°íŒ…ê³¼ ìŠ¤ìœ„ì¹­ ê¸°ìˆ ì„ ì‹¬í™” í•™ìŠµí•˜ì—¬ ëŒ€ê·œëª¨ ë„¤íŠ¸ì›Œí¬ ìš´ì˜ ëŠ¥ë ¥ì„ ê°–ì¶°ë³´ê² ìŠµë‹ˆë‹¤.

## ë¼ìš°íŒ… í”„ë¡œí† ì½œ | Routing Protocols

### ğŸ—ºï¸ ë¼ìš°íŒ… ê¸°ë³¸ ê°œë…

ë¼ìš°íŒ…ì€ íŒ¨í‚·ì´ ëª©ì ì§€ê¹Œì§€ ê°€ëŠ” ìµœì ì˜ ê²½ë¡œë¥¼ ì°¾ëŠ” ê³¼ì •ì…ë‹ˆë‹¤.

```bash
# ë¼ìš°íŒ… í…Œì´ë¸” êµ¬ì„± ìš”ì†Œ
ëª©ì ì§€ ë„¤íŠ¸ì›Œí¬ | ì„œë¸Œë„· ë§ˆìŠ¤í¬ | ê²Œì´íŠ¸ì›¨ì´ | ì¸í„°í˜ì´ìŠ¤ | ë©”íŠ¸ë¦­
192.168.1.0    | /24          | ì§ì ‘ì—°ê²°    | eth0      | 0
10.0.0.0       | /8           | 192.168.1.1| eth0      | 1
0.0.0.0        | /0           | 192.168.1.1| eth0      | 1 (ê¸°ë³¸ê²½ë¡œ)
```

### ğŸ“Š ë¼ìš°íŒ… í”„ë¡œí† ì½œ ë¶„ë¥˜

#### Distance Vector vs Link State
```
Distance Vector (ê±°ë¦¬ ë²¡í„°):
- RIP (Routing Information Protocol)
- ë²¨ë§Œ-í¬ë“œ ì•Œê³ ë¦¬ì¦˜ ì‚¬ìš©
- í™‰ ì¹´ìš´íŠ¸ ê¸°ë°˜ ë©”íŠ¸ë¦­
- ë‹¨ìˆœí•˜ì§€ë§Œ ìˆ˜ë ´ ì†ë„ ëŠë¦¼

Link State (ë§í¬ ìƒíƒœ):  
- OSPF (Open Shortest Path First)
- ë‹¤ìµìŠ¤íŠ¸ë¼ ì•Œê³ ë¦¬ì¦˜ ì‚¬ìš©
- ëŒ€ì—­í­ ê¸°ë°˜ ë©”íŠ¸ë¦­
- ë¹ ë¥¸ ìˆ˜ë ´, í™•ì¥ì„± ì¢‹ìŒ
```

#### IGP vs EGP
```
IGP (Interior Gateway Protocol):
- ê°™ì€ ììœ¨ ì‹œìŠ¤í…œ(AS) ë‚´ë¶€
- RIP, OSPF, EIGRP

EGP (Exterior Gateway Protocol):
- ì„œë¡œ ë‹¤ë¥¸ AS ê°„
- BGP (Border Gateway Protocol)
```

### ğŸ”„ RIP (Routing Information Protocol)

```bash
# Cisco ë¼ìš°í„° RIP ì„¤ì •
Router(config)# router rip
Router(config-router)# version 2
Router(config-router)# network 192.168.1.0
Router(config-router)# network 10.0.0.0
Router(config-router)# no auto-summary
Router(config-router)# passive-interface fastethernet 0/0

# Linux Quagga/FRR RIP ì„¤ì •
router rip
 version 2
 network 192.168.1.0/24
 network 10.0.0.0/8
 redistribute connected
 redistribute static

# RIP ì •ë³´ í™•ì¸
show ip route rip
show ip rip database
debug ip rip
```

#### RIPì˜ íŠ¹ì§•ê³¼ í•œê³„
```
ì¥ì :
- êµ¬ì„±ì´ ê°„ë‹¨í•¨
- ì†Œê·œëª¨ ë„¤íŠ¸ì›Œí¬ì— ì í•©
- í‘œì¤€ í”„ë¡œí† ì½œ

ë‹¨ì :
- í™‰ ì¹´ìš´íŠ¸ ì œí•œ (15í™‰)
- ëŠë¦° ìˆ˜ë ´ ì†ë„
- ëŒ€ì—­í­ ê³ ë ¤í•˜ì§€ ì•ŠìŒ
- ë£¨í”„ ë°©ì§€ ë©”ì»¤ë‹ˆì¦˜ ì œí•œì 
```

### ğŸŒ OSPF (Open Shortest Path First)

OSPFëŠ” ëŒ€ê·œëª¨ ë„¤íŠ¸ì›Œí¬ì—ì„œ ê°€ì¥ ë„ë¦¬ ì‚¬ìš©ë˜ëŠ” ë§í¬ ìƒíƒœ ë¼ìš°íŒ… í”„ë¡œí† ì½œì…ë‹ˆë‹¤.

#### OSPF ê¸°ë³¸ ê°œë…
```bash
# OSPF ìš©ì–´
Area: ë¼ìš°í„°ë“¤ì˜ ë…¼ë¦¬ì  ê·¸ë£¹
ABR (Area Border Router): Area ê²½ê³„ ë¼ìš°í„°
ASBR (Autonomous System Boundary Router): AS ê²½ê³„ ë¼ìš°í„°  
DR (Designated Router): ëŒ€í‘œ ë¼ìš°í„°
BDR (Backup Designated Router): ë°±ì—… ëŒ€í‘œ ë¼ìš°í„°

# LSA (Link State Advertisement) ìœ í˜•
LSA Type 1: Router LSA (ë¼ìš°í„° ì •ë³´)
LSA Type 2: Network LSA (ë„¤íŠ¸ì›Œí¬ ì •ë³´)
LSA Type 3: Summary LSA (Area ê°„ ìš”ì•½)
LSA Type 4: ASBR Summary LSA
LSA Type 5: External LSA (ì™¸ë¶€ ë¼ìš°íŠ¸)
```

#### OSPF ì„¤ì • ì‹¤ìŠµ
```bash
# Cisco ë¼ìš°í„° OSPF ì„¤ì •
Router(config)# router ospf 1
Router(config-router)# router-id 1.1.1.1
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.255.255.255 area 1
Router(config-router)# area 1 stub

# ì¸í„°í˜ì´ìŠ¤ë³„ OSPF ì„¤ì •
Router(config)# interface fastethernet 0/0
Router(config-if)# ip ospf cost 100
Router(config-if)# ip ospf priority 255
Router(config-if)# ip ospf hello-interval 5
Router(config-if)# ip ospf dead-interval 20

# Linux FRR OSPF ì„¤ì •
router ospf
 ospf router-id 1.1.1.1
 network 192.168.1.0/24 area 0.0.0.0
 network 10.0.0.0/8 area 0.0.0.1
 area 0.0.0.1 stub

# OSPF ì •ë³´ í™•ì¸
show ip ospf neighbor
show ip ospf database  
show ip ospf interface
show ip route ospf
```

#### OSPF Area ì„¤ê³„
```bash
# Multi-Area OSPF ì„¤ê³„ ì˜ˆì‹œ
Area 0 (Backbone): 10.0.0.0/24
â”œâ”€â”€ Area 1 (Sales): 10.1.0.0/16
â”œâ”€â”€ Area 2 (Engineering): 10.2.0.0/16  
â””â”€â”€ Area 3 (Guest): 10.3.0.0/16

# Area ìœ í˜•
Standard Area: ëª¨ë“  LSA í—ˆìš©
Stub Area: Type 5 LSA ì°¨ë‹¨, ê¸°ë³¸ ê²½ë¡œ ì£¼ì…
Totally Stub: Type 3,4,5 LSA ì°¨ë‹¨
NSSA: Type 5 LSAë¥¼ Type 7ë¡œ ë³€í™˜
```

### ğŸŒ BGP (Border Gateway Protocol)

BGPëŠ” ì¸í„°ë„·ì˜ ë¼ìš°íŒ…ì„ ë‹´ë‹¹í•˜ëŠ” ê²½ë¡œ ë²¡í„° í”„ë¡œí† ì½œì…ë‹ˆë‹¤.

#### BGP ê¸°ë³¸ ê°œë…
```bash
# BGP ì†ì„±
AS-Path: AS ë²ˆí˜¸ ê²½ë¡œ
Next-Hop: ë‹¤ìŒ í™‰ ì£¼ì†Œ  
Local Preference: ë¡œì»¬ ìš°ì„ ìˆœìœ„ (ë†’ì„ìˆ˜ë¡ ì„ í˜¸)
MED: Multi-Exit Discriminator (ë‚®ì„ìˆ˜ë¡ ì„ í˜¸)
Origin: ê²½ë¡œ ë°œìƒì§€ (IGP > EGP > Incomplete)
Community: ë¼ìš°íŒ… ì •ì±… íƒœê·¸
```

#### BGP ì„¤ì • ì˜ˆì‹œ
```bash
# Cisco ë¼ìš°í„° BGP ì„¤ì •
Router(config)# router bgp 65001
Router(config-router)# bgp router-id 1.1.1.1
Router(config-router)# neighbor 203.0.113.1 remote-as 65002
Router(config-router)# neighbor 203.0.113.1 description "ISP-A Connection"
Router(config-router)# network 192.168.0.0 mask 255.255.0.0
Router(config-router)# aggregate-address 192.168.0.0 255.255.0.0 summary-only

# BGP ê²½ë¡œ ì •ì±… ì„¤ì •
Router(config)# ip prefix-list ALLOW-CUSTOMERS seq 10 permit 192.168.0.0/16 le 24
Router(config)# route-map CUSTOMER-IN permit 10
Router(config-route-map)# match ip address prefix-list ALLOW-CUSTOMERS
Router(config-route-map)# set local-preference 200

Router(config)# router bgp 65001  
Router(config-router)# neighbor 203.0.113.1 route-map CUSTOMER-IN in

# Linux FRR BGP ì„¤ì •
router bgp 65001
 bgp router-id 1.1.1.1
 neighbor 203.0.113.1 remote-as 65002
 neighbor 203.0.113.1 description ISP-A
 address-family ipv4 unicast
  network 192.168.0.0/16
  neighbor 203.0.113.1 activate
```

## ìŠ¤ìœ„ì¹­ ê¸°ìˆ  | Switching Technology

### ğŸ”Œ ì´ë”ë„· ìŠ¤ìœ„ì¹­ ê¸°ë³¸

#### MAC ì£¼ì†Œ í•™ìŠµ ê³¼ì •
```bash
# 1ë‹¨ê³„: MAC ì£¼ì†Œ í…Œì´ë¸”ì´ ë¹„ì–´ìˆìŒ
Switch# show mac address-table
          Mac Address Table
-------------------------------------------
Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

# 2ë‹¨ê³„: PC-A(00:11:22:33:44:AA)ì—ì„œ PC-Bë¡œ í”„ë ˆì„ ì „ì†¡
# ìŠ¤ìœ„ì¹˜ê°€ í¬íŠ¸ 1ì—ì„œ ìˆ˜ì‹ , MAC ì£¼ì†Œ í•™ìŠµ

# 3ë‹¨ê³„: MAC ì£¼ì†Œ í…Œì´ë¸” ì—…ë°ì´íŠ¸  
Switch# show mac address-table
          Mac Address Table
-------------------------------------------
Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0011.2233.44aa    DYNAMIC     Fa0/1

# 4ë‹¨ê³„: ëª©ì ì§€ MAC ì£¼ì†Œë¥¼ ëª¨ë¥´ë¯€ë¡œ í”ŒëŸ¬ë”©
# 5ë‹¨ê³„: PC-Bê°€ ì‘ë‹µí•˜ë©´ í¬íŠ¸ 2ì—ì„œ í•™ìŠµ
```

#### ìŠ¤ìœ„ì¹˜ í¬íŠ¸ ì„¤ì •
```bash
# ì•¡ì„¸ìŠ¤ í¬íŠ¸ ì„¤ì • (ë‹¨ì¼ VLAN)
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security violation shutdown

# íŠ¸ë í¬ í¬íŠ¸ ì„¤ì • (ë‹¤ì¤‘ VLAN)
Switch(config)# interface fastethernet 0/24
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)# switchport trunk allowed vlan 10,20,30
Switch(config-if)# switchport trunk native vlan 1
```

### ğŸ·ï¸ VLAN (Virtual Local Area Network)

VLANì€ ë¬¼ë¦¬ì  ìœ„ì¹˜ì™€ ê´€ê³„ì—†ì´ ë…¼ë¦¬ì ìœ¼ë¡œ ë„¤íŠ¸ì›Œí¬ë¥¼ ë¶„í• í•˜ëŠ” ê¸°ìˆ ì…ë‹ˆë‹¤.

#### VLAN ì„¤ì • ë° ê´€ë¦¬
```bash
# VLAN ìƒì„±
Switch(config)# vlan 10
Switch(config-vlan)# name SALES
Switch(config-vlan)# vlan 20  
Switch(config-vlan)# name ENGINEERING
Switch(config-vlan)# vlan 30
Switch(config-vlan)# name GUEST

# VLAN ì •ë³´ í™•ì¸
Switch# show vlan brief
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
10   SALES                           active    Fa0/1, Fa0/2
20   ENGINEERING                     active    Fa0/3, Fa0/4  
30   GUEST                           active    
999  UNUSED                          active    

# ë™ì  VLAN í• ë‹¹ (VMPS)
Switch(config)# vmps server 192.168.1.100
Switch(config)# interface range fastethernet 0/1-20
Switch(config-if-range)# switchport mode dynamic desirable
```

#### Inter-VLAN ë¼ìš°íŒ…
```bash
# ë¼ìš°í„°ì˜ ì„œë¸Œì¸í„°í˜ì´ìŠ¤ ì„¤ì • (Router-on-a-Stick)
Router(config)# interface fastethernet 0/0
Router(config-if)# no shutdown
Router(config-if)# interface fastethernet 0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# interface fastethernet 0/0.20
Router(config-subif)# encapsulation dot1Q 20  
Router(config-subif)# ip address 192.168.20.1 255.255.255.0

# SVI (Switched Virtual Interface) ì„¤ì •
Switch(config)# ip routing
Switch(config)# interface vlan 10
Switch(config-if)# ip address 192.168.10.1 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# interface vlan 20
Switch(config-if)# ip address 192.168.20.1 255.255.255.0
Switch(config-if)# no shutdown
```

### ğŸŒ³ STP (Spanning Tree Protocol)

STPëŠ” ìŠ¤ìœ„ì¹˜ ë„¤íŠ¸ì›Œí¬ì—ì„œ ë£¨í”„ë¥¼ ë°©ì§€í•˜ê³  ì´ì¤‘í™”ë¥¼ ì œê³µí•˜ëŠ” í”„ë¡œí† ì½œì…ë‹ˆë‹¤.

#### STP ê¸°ë³¸ ê°œë…
```bash
# STP í¬íŠ¸ ìƒíƒœ
Disabled: í¬íŠ¸ ë¹„í™œì„±í™”
Blocking: ë°ì´í„° ì „ì†¡ ì°¨ë‹¨, BPDU ìˆ˜ì‹ ë§Œ
Listening: BPDU ì†¡ìˆ˜ì‹ , MAC ì£¼ì†Œ í•™ìŠµí•˜ì§€ ì•ŠìŒ
Learning: MAC ì£¼ì†Œ í•™ìŠµ, ë°ì´í„° ì „ì†¡í•˜ì§€ ì•ŠìŒ  
Forwarding: ì •ìƒ ë°ì´í„° ì „ì†¡

# STP í¬íŠ¸ ì—­í• 
Root Port: ë£¨íŠ¸ ë¸Œë¦¬ì§€ë¡œ ê°€ëŠ” ìµœë‹¨ ê²½ë¡œ
Designated Port: ì„¸ê·¸ë¨¼íŠ¸ì˜ ëŒ€í‘œ í¬íŠ¸
Alternate Port: ë£¨íŠ¸ í¬íŠ¸ì˜ ë°±ì—…
Backup Port: ê°™ì€ ìŠ¤ìœ„ì¹˜ì˜ ë‹¤ë¥¸ í¬íŠ¸ ë°±ì—…
```

#### STP ì„¤ì • ë° ìµœì í™”
```bash
# ë£¨íŠ¸ ë¸Œë¦¬ì§€ ì„¤ì •
Switch(config)# spanning-tree vlan 1 root primary
Switch(config)# spanning-tree vlan 1 priority 4096

# í¬íŠ¸ ìš°ì„ ìˆœìœ„ ë° ë¹„ìš© ì„¤ì •
Switch(config)# interface fastethernet 0/1  
Switch(config-if)# spanning-tree vlan 1 port-priority 128
Switch(config-if)# spanning-tree vlan 1 cost 19

# RSTP (Rapid Spanning Tree) ì„¤ì •
Switch(config)# spanning-tree mode rapid-pvst

# í¬íŠ¸ ìµœì í™”
Switch(config)# interface range fastethernet 0/1-20
Switch(config-if-range)# spanning-tree portfast
Switch(config-if-range)# spanning-tree bpduguard enable

# STP ì •ë³´ í™•ì¸
Switch# show spanning-tree
Switch# show spanning-tree vlan 1
Switch# show spanning-tree interface fastethernet 0/1
```

#### MST (Multiple Spanning Tree)
```bash
# MST ì„¤ì •
Switch(config)# spanning-tree mode mst
Switch(config)# spanning-tree mst configuration
Switch(config-mst)# name COMPANY  
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 10,20
Switch(config-mst)# instance 2 vlan 30,40
Switch(config-mst)# exit

# MST ë£¨íŠ¸ ì„¤ì •
Switch(config)# spanning-tree mst 1 root primary
Switch(config)# spanning-tree mst 2 root secondary
```

## ê³ ê¸‰ ë„¤íŠ¸ì›Œí‚¹ ê¸°ìˆ  | Advanced Networking

### ğŸ”— Link Aggregation (EtherChannel)

ì—¬ëŸ¬ ë¬¼ë¦¬ì  ë§í¬ë¥¼ ë…¼ë¦¬ì ìœ¼ë¡œ ë¬¶ì–´ ëŒ€ì—­í­ì„ ì¦ê°€ì‹œí‚¤ê³  ì´ì¤‘í™”ë¥¼ ì œê³µí•©ë‹ˆë‹¤.

```bash
# LACP (Link Aggregation Control Protocol) ì„¤ì •
Switch(config)# interface range fastethernet 0/1-2
Switch(config-if-range)# channel-group 1 mode active
Switch(config-if-range)# exit
Switch(config)# interface port-channel 1
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20,30

# PAgP (Port Aggregation Protocol) ì„¤ì •  
Switch(config)# interface range fastethernet 0/3-4
Switch(config-if-range)# channel-group 2 mode desirable

# ì •ì  EtherChannel ì„¤ì •
Switch(config)# interface range fastethernet 0/5-6  
Switch(config-if-range)# channel-group 3 mode on

# EtherChannel í™•ì¸
Switch# show etherchannel summary
Switch# show etherchannel port-channel
```

### ğŸŒ VXLAN (Virtual Extensible LAN)

í´ë¼ìš°ë“œ í™˜ê²½ì—ì„œ L2 ì˜¤ë²„ë ˆì´ ë„¤íŠ¸ì›Œí¬ë¥¼ êµ¬í˜„í•˜ëŠ” ê¸°ìˆ ì…ë‹ˆë‹¤.

```bash
# Linuxì—ì„œ VXLAN ì„¤ì •
# VXLAN ì¸í„°í˜ì´ìŠ¤ ìƒì„±
ip link add vxlan10 type vxlan id 10 remote 192.168.1.2 local 192.168.1.1 dev eth0 dstport 4789

# VXLANì„ ë¸Œë¦¬ì§€ì— ì—°ê²°
ip link add br0 type bridge
ip link set vxlan10 master br0
ip link set eth1 master br0

# ì¸í„°í˜ì´ìŠ¤ í™œì„±í™”
ip link set vxlan10 up
ip link set br0 up

# ë©€í‹°ìºìŠ¤íŠ¸ VXLAN
ip link add vxlan20 type vxlan id 20 group 239.1.1.1 dev eth0 dstport 4789

# VXLAN ì •ë³´ í™•ì¸
bridge fdb show dev vxlan10
ip -d link show vxlan10
```

### âš–ï¸ ë¡œë“œ ë°¸ëŸ°ì‹±

#### HAProxy ì„¤ì •
```bash
# HAProxy ì„¤ì • íŒŒì¼ (/etc/haproxy/haproxy.cfg)
global
    daemon
    maxconn 4096
    log 127.0.0.1:514 local0

defaults
    mode http
    timeout connect 5000ms
    timeout client 50000ms
    timeout server 50000ms
    option httplog

frontend web_frontend
    bind *:80
    bind *:443 ssl crt /etc/ssl/certs/website.pem
    redirect scheme https if !{ ssl_fc }
    default_backend web_servers

backend web_servers
    balance roundrobin
    option httpchk GET /health
    server web1 192.168.1.10:80 check
    server web2 192.168.1.11:80 check
    server web3 192.168.1.12:80 check backup

# í†µê³„ í˜ì´ì§€
listen stats
    bind *:8080
    stats enable
    stats uri /stats
    stats refresh 30s
```

#### NGINX ë¡œë“œ ë°¸ëŸ°ì‹±
```nginx
# /etc/nginx/nginx.conf
upstream backend {
    least_conn;  # ë¡œë“œ ë°¸ëŸ°ì‹± ë°©ë²•
    server 192.168.1.10:80 max_fails=3 fail_timeout=30s;
    server 192.168.1.11:80 max_fails=3 fail_timeout=30s;
    server 192.168.1.12:80 backup;
}

server {
    listen 80;
    location / {
        proxy_pass http://backend;
        proxy_set_header Host $host;
        proxy_set_header X-Real-IP $remote_addr;
        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
        
        # í—¬ìŠ¤ ì²´í¬
        proxy_connect_timeout 1s;
        proxy_send_timeout 1s;
        proxy_read_timeout 1s;
    }
}
```

### ğŸ” ë„¤íŠ¸ì›Œí¬ ë³´ì•ˆ ì‹¬í™”

#### í¬íŠ¸ ë³´ì•ˆ (Port Security)
```bash
# MAC ì£¼ì†Œ ê¸°ë°˜ í¬íŠ¸ ë³´ì•ˆ
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation restrict

# 802.1X ì¸ì¦ ì„¤ì •
Switch(config)# aaa new-model
Switch(config)# aaa authentication dot1x default group radius
Switch(config)# dot1x system-auth-control
Switch(config)# interface fastethernet 0/1
Switch(config-if)# authentication port-control auto
Switch(config-if)# dot1x pae authenticator
```

#### ACL (Access Control List) ì‹¬í™”
```bash
# í™•ì¥ ACL
Router(config)# ip access-list extended BLOCK_SOCIAL
Router(config-ext-nacl)# deny tcp any host 23.35.67.140 eq 80
Router(config-ext-nacl)# deny tcp any host 23.35.67.141 eq 443  
Router(config-ext-nacl)# permit ip any any
Router(config-ext-nacl)# exit
Router(config)# interface fastethernet 0/1
Router(config-if)# ip access-group BLOCK_SOCIAL out

# ì‹œê°„ ê¸°ë°˜ ACL
Router(config)# time-range WORK_HOURS
Router(config-time-range)# periodic weekdays 09:00 to 18:00
Router(config)# ip access-list extended TIME_BASED
Router(config-ext-nacl)# permit tcp 192.168.1.0 0.0.0.255 any eq 80 time-range WORK_HOURS
Router(config-ext-nacl)# deny tcp 192.168.1.0 0.0.0.255 any eq 80

# ë°˜ì‚¬í˜• ACL (Reflexive ACL)
Router(config)# ip access-list extended OUTBOUND
Router(config-ext-nacl)# permit tcp 192.168.1.0 0.0.0.255 any reflect TCP_TRAFFIC
Router(config-ext-nacl)# permit icmp 192.168.1.0 0.0.0.255 any reflect ICMP_TRAFFIC

Router(config)# ip access-list extended INBOUND  
Router(config-ext-nacl)# evaluate TCP_TRAFFIC
Router(config-ext-nacl)# evaluate ICMP_TRAFFIC
Router(config-ext-nacl)# deny ip any any
```

## ë„¤íŠ¸ì›Œí¬ ëª¨ë‹ˆí„°ë§ ë° ë¬¸ì œ í•´ê²° | Network Monitoring & Troubleshooting

### ğŸ“Š SNMP (Simple Network Management Protocol)

```bash
# SNMP v3 ì„¤ì • (Cisco)
Router(config)# snmp-server view READONLY iso included
Router(config)# snmp-server group ADMIN v3 auth read READONLY  
Router(config)# snmp-server user admin ADMIN v3 auth sha password123 priv aes 128 password456
Router(config)# snmp-server host 192.168.1.100 version 3 auth admin

# Linux SNMP í´ë¼ì´ì–¸íŠ¸
# OIDë¥¼ ì´ìš©í•œ ì •ë³´ ì¡°íšŒ
snmpwalk -v3 -u admin -a SHA -A password123 -x AES -X password456 -l authPriv 192.168.1.1 1.3.6.1.2.1.1

# ì¸í„°í˜ì´ìŠ¤ í†µê³„ ì¡°íšŒ
snmpwalk -v3 -u admin -a SHA -A password123 -x AES -X password456 -l authPriv 192.168.1.1 1.3.6.1.2.1.2.2.1.10
```

### ğŸ” ë„¤íŠ¸ì›Œí¬ ë¶„ì„ ë„êµ¬

#### Wireshark ê³ ê¸‰ í•„í„°
```bash
# í”„ë¡œí† ì½œë³„ í•„í„°
tcp.port == 80                    # HTTP íŠ¸ë˜í”½
tcp.flags.syn == 1 and tcp.flags.ack == 0  # TCP SYN íŒ¨í‚·
icmp.type == 8                    # ICMP Echo Request
dns.qry.name contains "google"    # DNS ì¿¼ë¦¬

# ë„¤íŠ¸ì›Œí¬ë³„ í•„í„°
ip.src == 192.168.1.0/24          # ì†ŒìŠ¤ ë„¤íŠ¸ì›Œí¬
ip.dst == 10.0.0.0/8             # ëª©ì ì§€ ë„¤íŠ¸ì›Œí¬
eth.addr == 00:11:22:33:44:55     # MAC ì£¼ì†Œ

# ì„±ëŠ¥ ë¶„ì„
tcp.analysis.retransmission       # TCP ì¬ì „ì†¡
tcp.analysis.duplicate_ack        # ì¤‘ë³µ ACK
tcp.analysis.zero_window          # ì œë¡œ ìœˆë„ìš°
```

#### ë„¤íŠ¸ì›Œí¬ ì„±ëŠ¥ ì¸¡ì •
```bash
# ëŒ€ì—­í­ ì¸¡ì • (iperf3)
# ì„œë²„ ëª¨ë“œ
iperf3 -s -p 5201

# í´ë¼ì´ì–¸íŠ¸ ëª¨ë“œ  
iperf3 -c 192.168.1.100 -p 5201 -t 60 -P 4

# UDP ì¸¡ì •
iperf3 -c 192.168.1.100 -u -b 100M

# ì§€ì—° ì‹œê°„ ì¸¡ì • (hping3)
hping3 -S -p 80 -c 10 google.com
hping3 -1 -c 100 -i u1000 192.168.1.1  # ë§ˆì´í¬ë¡œì´ˆ ê°„ê²©

# MTU ê²½ë¡œ ë°œê²¬
tracepath google.com
ping -M do -s 1472 google.com
```

## ë‹¤ìŒ í¸ ì˜ˆê³ 

ë‹¤ìŒ í¬ìŠ¤íŠ¸ì—ì„œëŠ” **ë¬´ì„  ë„¤íŠ¸ì›Œí‚¹ê³¼ ìµœì‹  ê¸°ìˆ **ì„ ë‹¤ë£° ì˜ˆì •ì…ë‹ˆë‹¤:
- Wi-Fi 6/6E ê¸°ìˆ 
- SD-WANê³¼ ë„¤íŠ¸ì›Œí¬ ê°€ìƒí™”
- 5Gì™€ ì—£ì§€ ì»´í“¨íŒ…
- ë„¤íŠ¸ì›Œí¬ ìë™í™” (Ansible, Python)

ë¼ìš°íŒ…ê³¼ ìŠ¤ìœ„ì¹­ ê¸°ìˆ ì„ ì™„ì „íˆ ë§ˆìŠ¤í„°í•˜ì…¨ë‚˜ìš”? ğŸš€